#+TITLE: Reproducible poster generation
#+AUTHOR: Alán F. Muñoz

***** Colors
#+BEGIN_SRC latex
  \definecolor{red}{RGB}{221,42,43}
  \definecolor{green}{RGB}{105,182,40}
  \definecolor{blue}{RGB}{0,51,153}
  \definecolor{gray}{RGB}{25,25,25}
  %\definecolor{red}{HTML}{D43F3F}
  %\definecolor{blue}{HTML}{00ACE9}
  %\definecolor{green}{HTML}{6A9A1F}
  \colorlet{theMainColor}{blue}
  \colorlet{theRefColor}{blue!90}
  \newcommand{\globalcolor}[1]{%

    \color{#1}\global\let\default@color\current@color
  }
#+END_SRC

#+RESULTS:
#+begin_export latex
\definecolor{red}{RGB}{221,42,43}
  \definecolor{green}{RGB}{105,182,40}
  \definecolor{blue}{RGB}{0,51,153}
  \definecolor{gray}{RGB}{25,25,25}
  \colorlet{theMainColor}{blue}
  \colorlet{theRefColor}{blue!90}
  \newcommand{\globalcolor}[1]{%
    \color{#1}\global\let\default@color\current@color
  }
#+end_export

**** Default list of LaTeX packages
Only include one default package and remove all the crapppy stuff included by
=org= \rightarrow =latex= translation.

#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-latex-packages-alist '("" "org-preamble"))
#+END_SRC

#+RESULTS:
|   | org-preamble |

**** Set LaTeX command
#+BEGIN_SRC emacs-lisp
  (setq org-latex-pdf-process '("latexmk -xelatex -shell-escape -quiet %f"))
#+END_SRC

#+RESULTS:
| latexmk -xelatex -shell-escape -quiet %f |

